Repository: khaled2024/BloodBank
Catalog: BloodBank/Locolaizable/*.lproj/Localizable.strings
Languages: ar

source: Change Language
ar: تغيير اللغه

source: Blood Needs
ar: احتياجات الدم

source: Blood Type:
ar: انواع الدم

source: Blood Donation
ar: التبرع بالدم

source: Health Assessment
ar: التقييم الصحي

source: Eligibility Requirements
ar: متطلبات الأهلية

source: FAQs
ar: أسئلة وأجوبة

# firstCell
source: When you donate blood, organizations such as the Red Cross will usually separate whole blood into red blood cells, plasma and platelets in a lab. Plasma can treat all kinds of things like cancer, blood diseases, haemophilia, anaemia, heart disease, stomach disease, kidney disease, childbirth, operations, blood loss, trauma and burns. Every 2 seconds someone in the U.S.needs blood and or platelets. Approximately 29,000 units of red blood cells are needed every day in the U. S. Nearly 5,000 units of platelets and 6.500 units of plasma are needed daily in the U.S. Nearly 16 million blood components are transfused each year in the U.S.Sickle cell disease affects 90,000 to 100,000 people in the U.S. About 1,000 babies are born with the disease each year. Sickle cell patients can require blood transfusions throughout their lives.The average red blood cell transfusion is approximately 3 units.A single car accident victim can require as many as 100 units of blood. Blood and platelets cannot be manufactured; they can only come from volunteer donors.The blood type most often requested by hospitals is type O.One donation can help save more than one life.According to the American Cancer Society, more than 1.8 million people are expected to be diagnosed with cancer in 2020. Many of them will need blood, sometimes daily, during their chemotherapy treatment.
ar: عندما تتبرع بالدم ، عادة ما تقوم منظمات مثل الصليب الأحمر بفصل الدم الكامل إلى خلايا الدم الحمراء والبلازما والصفائح الدموية في المختبر. يمكن أن تعالج البلازما جميع أنواع الأمراض مثل السرطان وأمراض الدم والناعور وفقر الدم وأمراض القلب وأمراض المعدة وأمراض الكلى والولادة والعمليات وفقدان الدم والصدمات والحروق. كل ثانيتين يحتاج شخص ما في الولايات المتحدة إلى الدم و / أو الصفائح الدموية. هناك حاجة إلى ما يقرب من 29000 وحدة من خلايا الدم الحمراء كل يوم في الولايات المتحدة. هناك حاجة إلى ما يقرب من 5000 وحدة من الصفائح الدموية و 6.500 وحدة من البلازما يوميًا في الولايات المتحدة. يتم نقل ما يقرب من 16 مليون عنصر من مكونات الدم كل عام في الولايات المتحدة ، ويؤثر مرض الخلايا المنجلية على 90.000 إلى 100.000 شخص في الولايات المتحدة يولد حوالي 1000 طفل مصاب بهذا المرض كل عام. يمكن لمرضى الخلايا المنجلية أن يحتاجوا إلى عمليات نقل دم طوال حياتهم ، ويبلغ متوسط ​​نقل خلايا الدم الحمراء حوالي 3 وحدات ، ويمكن لضحية حادث سيارة واحد أن تتطلب ما يصل إلى 100 وحدة من الدم. لا يمكن تصنيع الدم والصفائح الدموية ؛ لا يمكن أن تأتي إلا من متبرعين متطوعين ، وفصيلة الدم التي تطلبها المستشفيات غالبًا هي النوع O ، ويمكن أن يساعد التبرع الواحد في إنقاذ أكثر من حياة ، ووفقًا لجمعية السرطان الأمريكية ، من المتوقع أن يتم تشخيص أكثر من 1.8 مليون شخص بالسرطان في 2020. سيحتاج الكثير منهم إلى الدم ، أحيانًا يوميًا ، أثناء العلاج الكيميائي.

# secondCell
source: Group A : has only the A antigen on red cells (and B antibody in the plasma) Group B : has only the B antigen on red cells (and A antibody in the plasma) Group AB : has both A and B antigens on red cells (but neither A nor B antibody in the plasma) Group O : has neither A nor B antigens on red cells (but both A and B antibody are in the plasma) There are very specific ways in which blood types must be matched for a safe transfusion. The right blood transfusion can mean the difference between life and death. Use the interactive graphic below to learn more about matching blood types for transfusions.Also, Rh-negative blood is given to Rh-negative patients, and Rh-positive or Rh-negative blood may be given to Rh-positive patients. The rules for plasma are the reverse. There are more than 600 other known antigens, the presence or absence of which creates rare blood types. Certain blood types are unique to specific ethnic or racial groups. That’s why an African-American blood donation may be the best hope for the needs of patients with sickle cell disease, many of whom are of African descent Universal donors are those with an O negative blood type. Why? O negative blood can be used in transfusions for any blood type. Type O is routinely in short supply and in high demand by hospitals – both because it is the most common blood type and because type O negative blood is the universal blood type needed for emergency transfusions and for immune deficient infants.Approximately 45 percent of Caucasians are type O (positive or negative), but 51 percent of African-Americans and 57 percent of Hispanics are type O. Minority and diverse populations, therefore, play a critical role in meeting the constant need for blood.Types O negative and O positive are in high demand. Only 7% of the population are O negative. However, the need for O negative blood is the highest because it is used most often during emergencies. The need for O+ is high because it is the most frequently occurring blood type (37% of the population).The universal red cell donor has Type O negative blood. The universal plasma donor has Type AB blood. For more about plasma donation, visit the plasma donation facts.
ar: المجموعة أ: تحتوي فقط على مستضد A على الخلايا الحمراء (والجسم المضاد B في البلازما) المجموعة B: تحتوي فقط على مستضد B على الخلايا الحمراء (والجسم المضاد A في البلازما) المجموعة AB: تحتوي على مستضدات A و B على الخلايا الحمراء (ولكن لا يوجد أي من الأجسام المضادة A و B في البلازما) المجموعة O: لا تحتوي على مستضدات A و B على الخلايا الحمراء (لكن كلا من الجسم المضاد A و B موجودان في البلازما) هناك طرق محددة جدًا يجب من خلالها مطابقة أنواع الدم من أجل الأمان نقل الدم. يمكن أن يعني نقل الدم الصحيح الفرق بين الحياة والموت. استخدم الرسم التفاعلي أدناه لمعرفة المزيد حول مطابقة أنواع الدم لعمليات نقل الدم. أيضًا ، يتم إعطاء دم سلبي عامل ريسس للمرضى سلبي عامل ريسس ، ويمكن إعطاء دم موجب أو سلبي عامل ريسس للمرضى الموجبة للعامل الريصي. قواعد البلازما هي عكس ذلك. هناك أكثر من 600 مستضد معروف آخر ، وجود أو عدم وجود أنواع دم نادرة. بعض أنواع الدم تكون فريدة من نوعها لمجموعات عرقية أو عرقية معينة. هذا هو السبب في أن التبرع بالدم من أصل أفريقي قد يكون أفضل أمل لاحتياجات المرضى الذين يعانون من مرض فقر الدم المنجلي ، وكثير منهم من أصل أفريقي المتبرعون العالميون هم أولئك الذين لديهم فصيلة دم سلبية O. لماذا ا؟ يمكن استخدام الدم السالب O في عمليات نقل الدم لأي فصيلة دم. يعاني النوع O بشكل روتيني من نقص في الإمداد وارتفاع الطلب عليه من قبل المستشفيات - لأنه أكثر فصيلة الدم شيوعًا ولأن الدم السلبي من النوع O هو فصيلة الدم الشاملة اللازمة لعمليات نقل الدم الطارئة وللأطفال الذين يعانون من نقص المناعة. النوع O (إيجابي أو سلبي) ، لكن 51٪ من الأمريكيين من أصل أفريقي و 57٪ من ذوي الأصول الأسبانية هم من النوع O. لذلك تلعب الأقليات والسكان المتنوعون دورًا مهمًا في تلبية الحاجة المستمرة للدم. كثير الطلب. فقط 7 ٪ من السكان يعانون من O سلبي. ومع ذلك ، فإن الحاجة إلى الدم السلبي O هي الأعلى لأنها تستخدم في أغلب الأحيان أثناء حالات الطوارئ. إن الحاجة إلى O + مرتفعة لأنها أكثر فصيلة الدم تكرارا (37٪ من السكان) ، والمتبرع العام بالخلايا الحمراء لديه دم سالب من النوع O. المتبرع العالمي بالبلازما لديه دم من النوع AB. لمزيد من المعلومات حول التبرع بالبلازما ، قم بزيارة حقائق التبرع بالبلازما.

# thirdCell
source: (Registration) : We’ll sign you in and go over basic eligibility. You’ll be asked to show ID, such as your driver’s license.You’ll read some information about donating blood.We’ll ask you for your complete address. Your address needs to be complete (including PO Box, street/apartment number) and the place where you will receive your mail 8 weeks from donation. (Health History) : You’ll answer a few questions about your health history and places you’ve traveled, during a private and confidential interview.You’ll tell us about any prescription and/or over the counter medications that may be in your system.We’ll check your temperature, pulse, blood pressure and hemoglobin level. (Your Donation) : If you’re donating whole blood, we’ll cleanse an area on your arm and insert a brand new sterile needle for the blood draw. (This feels like a quick pinch and is over in seconds.)Other types of donations, such as platelets, are made using an apheresis machine which will be connected to both arms. A whole blood donation takes about 8-10 minutes, during which you’ll be seated comfortably or lying down.When approximately a pint of whole blood has been collected, the donation is complete and a staff person will place a bandage on your arm.For platelets, the apheresis machine will collect a small amount of blood, remove the platelets, and return the rest of the blood through your other arm; this cycle will be repeated several times over about 2 hours. (Refreshment and Recovery) : After donating blood, you’ll have a snack and something to drink in the refreshment area. You’ll leave after 10-15 minutes and continue your normal routine. Enjoy the feeling of accomplishment knowing you are helping to save lives. Take a selfie, or simply share your good deed with friends. It may inspire them to become blood donors.
ar: (التسجيل): سنقوم بتسجيل الدخول واستعراض الأهلية الأساسية. سيُطلب منك إبراز بطاقة الهوية ، مثل رخصة القيادة الخاصة بك. ستقرأ بعض المعلومات حول التبرع بالدم ، وسنطلب منك عنوانك الكامل. يجب أن يكون عنوانك كاملاً (بما في ذلك صندوق البريد ورقم الشارع / الشقة) والمكان الذي ستتلقى فيه بريدك بعد 8 أسابيع من التبرع. (التاريخ الصحي): ستجيب على بعض الأسئلة حول تاريخك الصحي والأماكن التي سافرت إليها ، خلال مقابلة خاصة وسرية. ستخبرنا عن أي وصفة طبية و / أو الأدوية التي لا تحتاج إلى وصفة طبية التي قد تكون في الخاص بك النظام: سوف نتحقق من درجة حرارتك ونبضك وضغط الدم ومستوى الهيموجلوبين لديك. (تبرعك): إذا كنت تتبرع بدم كامل ، فسنقوم بتنظيف منطقة على ذراعك وإدخال إبرة معقمة جديدة لسحب الدم. (هذا يبدو وكأنه قرصة سريعة وينتهي في ثوانٍ.) أنواع أخرى من التبرعات ، مثل الصفائح الدموية ، يتم إجراؤها باستخدام آلة فصل مكونات الدم التي سيتم توصيلها بكلتا الذراعين. يستغرق التبرع الكامل بالدم حوالي 8-10 دقائق ، حيث ستجلس بشكل مريح أو مستلقٍ ، وعندما يتم جمع نصف لتر من الدم الكامل ، يكتمل التبرع وسيضع أحد الموظفين ضمادة على ذراعك. بالنسبة للصفائح الدموية ، ستجمع آلة الفصادة كمية صغيرة من الدم ، وتزيل الصفائح الدموية ، وتعيد باقي الدم عبر ذراعك الأخرى ؛ ستتكرر هذه الدورة عدة مرات على مدار حوالي ساعتين. (الانتعاش والتعافي): بعد التبرع بالدم ، ستحصل على وجبة خفيفة وشيء تشربه في منطقة المرطبات. ستغادر بعد 10-15 دقيقة وتواصل روتينك المعتاد. استمتع بشعور الإنجاز وأنت تعلم أنك تساعد في إنقاذ الأرواح. التقط صورة ذاتية ، أو شارك عملك الصالح مع الأصدقاء. قد يلهمهم أن يصبحوا متبرعين بالدم.

# forthCell
source: Your Health Screening When you come in to donate, you help provide lifesaving care to patients in need. But you also receive the added benefit of a free mini-health assessment, provided by a trained Red Cross staff member. Prior to donating blood, all donors will receive a free health screening. At the time of your donation, your blood pressure, hemoglobin, and pulse will be checked. We record these vitals in your online donor profile where you can track and monitor your results. You can access this information as well as past health information obtained during prior donations, at any time. Your online profile is a great resource to track your health goals and share with your care providers. Your health is an important part of your donor journey and key to continuing to help others in need. What is done during the test and what is measured Prior to donating blood, all donors will receive a free health screening. At the time of your donation, your blood pressure, hemoglobin, and pulse will be checked. We record these vitals in your online donor profile. You can access this information as well as past health information obtained during prior donations, at any time. We encourage you to share your results with your healthcare provider at your next visit. (Blood Pressure) The Application checks your blood pressure before every donation. When untreated, high blood pressure can increase the risk of heart attack, stroke and other health complications. Also known as hypertension, the condition usually has no symptoms, and is often called the (silent killer) (Pulse) Your pulse will be checked before every Red Cross blood donation. Staff will measure the number of times your heart beats per minute and count any irregular heartbeats. Your pulse rate gives insights into your heart rhythm and how well your heart may be working. A heart rate that is too fast, too slow, or irregular can indicate an underlying condition. (Hemoglobin) The Red Cross checks your hemoglobin before every donation to ensure that you are healthy enough to donate. Hemoglobin is a protein that contains iron and carries oxygen to the tissues in your body. Iron is essential to help your body to replace new red blood cells lost through blood donations.
ar: فحص صحتك عندما تأتي للتبرع ، فإنك تساعد في توفير الرعاية المنقذة للحياة للمرضى المحتاجين. ولكنك تحصل أيضًا على فائدة إضافية تتمثل في التقييم الصحي المصغر المجاني الذي يقدمه أحد موظفي الصليب الأحمر المدربين. قبل التبرع بالدم ، سيحصل جميع المتبرعين على فحص صحي مجاني. في وقت التبرع ، سيتم فحص ضغط الدم والهيموجلوبين والنبض. نقوم بتسجيل هذه العناصر الحيوية في ملف تعريف المتبرع الخاص بك عبر الإنترنت حيث يمكنك تتبع نتائجك ومراقبتها. يمكنك الوصول إلى هذه المعلومات بالإضافة إلى المعلومات الصحية السابقة التي تم الحصول عليها أثناء التبرعات السابقة ، في أي وقت. يعد ملفك الشخصي عبر الإنترنت مصدرًا رائعًا لتتبع أهدافك الصحية ومشاركتها مع مقدمي الرعاية. تعد صحتك جزءًا مهمًا من رحلة المتبرع ومفتاح للاستمرار في مساعدة الآخرين المحتاجين. ما الذي يتم خلال الاختبار وما يتم قياسه قبل التبرع بالدم ، سيحصل جميع المتبرعين على فحص صحي مجاني. في وقت التبرع ، سيتم فحص ضغط الدم والهيموجلوبين والنبض. نسجل هذه العناصر الحيوية في ملف تعريف المتبرع الخاص بك عبر الإنترنت. يمكنك الوصول إلى هذه المعلومات بالإضافة إلى المعلومات الصحية السابقة التي تم الحصول عليها أثناء التبرعات السابقة ، في أي وقت. نحن نشجعك على مشاركة نتائجك مع مقدم الرعاية الصحية الخاص بك في زيارتك القادمة.(ضغط الدم) : يقوم التطبيق بفحص ضغط الدم قبل كل تبرع. عند عدم العلاج ، يمكن أن يؤدي ارتفاع ضغط الدم إلى زيادة خطر الإصابة بالنوبات القلبية والسكتة الدماغية والمضاعفات الصحية الأخرى. يُعرف أيضًا باسم ارتفاع ضغط الدم ، وعادةً لا تظهر أي أعراض على هذه الحالة ، ويُطلق عليها غالبًا (القاتل الصامت).(نبض) : سيتم فحص نبضك قبل كل تبرع من الصليب الأحمر بالدم. سيقيس الموظفون عدد مرات ضربات قلبك في الدقيقة ويحسبون أي ضربات قلب غير منتظمة. يوفر معدل النبض لديك نظرة ثاقبة على إيقاع قلبك ومدى جودة عمل قلبك. يمكن أن يشير معدل ضربات القلب السريع جدًا أو البطيء جدًا أو غير المنتظم إلى حالة كامنة. (الهيموغلوبين) : يقوم الصليب الأحمر بفحص الهيموجلوبين الخاص بك قبل كل تبرع للتأكد من أنك بصحة جيدة بما يكفي للتبرع. الهيموجلوبين هو بروتين يحتوي على الحديد وينقل الأكسجين إلى أنسجة الجسم. الحديد ضروري لمساعدة جسمك على تعويض خلايا الدم الحمراء الجديدة المفقودة من خلال التبرع بالدم.

# fifthCell
source: Requirements by Donation Type To ensure the safety of both patients and donors, these are some of the requirements donors must meet to be eligible to donate blood based on their donation type. Whole Blood Donation Donation frequency: Every 56 days, up to 6 times a year You must be in good health and feeling well You must be at least 16 years old in most states You must weigh at least 110 lbs Platelet Donation Donation frequency: Every 7 days, up to 24 times/year You must be in good health and feeling well You must be at least 17 years old in most states You must weigh at least 110 lbs AB Elite Plasma Donation Donation frequency: Every 28 days, up to 13 times/year You must have type AB blood You must be in good health and feeling well You must be at least 17 years old You must weigh at least 110 lbs
ar: المتطلبات حسب نوع التبرع لضمان سلامة كل من المرضى والمتبرعين ، فهذه بعض المتطلبات التي يجب على المتبرعين تلبيتها ليكونوا مؤهلين للتبرع بالدم بناءً على نوع تبرعهم.التبرع بالدم الكامل عدد مرات التبرع: كل 56 يوم حتى 6 مرات في السن يجب أن تكون بصحة جيدة وشعور جيد يجب ألا يقل عمرك عن 16 عامًا في معظم الولايات يجب أن تزن 110 رطلاً على الأقل (التبرع بالصفائح الدموية) عدد مرات التبرع: كل 7 أيام حتى 24 مرة في السنة يجب أن تكون بصحة جيدة وشعور جيد يجب ألا يقل عمرك عن 17 عامًا في معظم الولايات يجب أن تزن 110 رطلاً على الأقل (التبرع بالبلازما AB Elite) عدد مرات التبرع: كل 28 يوم حتى 13 مرة في السنة يجب أن يكون لديك فصيلة دم AB يجب أن تكون بصحة جيدة وشعور جيد يجب ألا يقل عمرك عن 17 عامًا يجب أن تزن 110 رطلاً على الأقل

# sixCell
source: How many people donate blood each year? 108 million donations are collected each year from unpaid voluntary donors, paid donors or family members. In 62 countries, 100 percent of donations are collected from unpaid volunteers. According to the World Health Organization (WHO) the world should aim to reach 100 percent unpaid voluntary donations by 2020. 72 countries already are close, getting 93 percent of blood from unpaid voluntary donors. In low income countries, youth (18-24) donate more blood than any other age, meanwhile in high income countries the most common age bracket is slightly older (25-44). What are the policies around donating blood around the world? Over 168 countries have a system in place to collect blood donations. 81 percent of blood donations from high-income countries have a national policy (this is where more than 50 percent of donations come from), while 44 percent of low-income countries have a set policy. WHO recommends implementing a testing and screening system for all blood donations, a policy that many high-income countries strictly adhere to. With HIV testing this can be complicated, however, because the virus can remain undetected for an average of 22 days. Where can you get paid for donating blood? You can get paid for donating blood in 25 countries around the world. Some countries will give you paid time off work to go donate blood, while others like Germany, China, US, and Russia pay for plasma donations.
ar: كم عدد الأشخاص الذين يتبرعون بالدم كل عام؟ يتم جمع 108 مليون تبرع سنويًا من متبرعين غير مدفوعي الأجر أو متبرعين بأجر أو من أفراد الأسرة. في 62 دولة ، يتم جمع 100 في المائة من التبرعات من متطوعين بدون أجر. وفقًا لمنظمة الصحة العالمية (WHO) ، يجب أن يهدف العالم إلى الوصول إلى تبرعات طوعية غير مدفوعة بنسبة 100 في المائة بحلول عام 2020. وهناك 72 دولة قريبة بالفعل ، حيث تحصل على 93 في المائة من الدم من متبرعين طوعيين غير مدفوعي الأجر. في البلدان منخفضة الدخل ، يتبرع الشباب (18-24) بدم أكثر من أي عمر آخر ، وفي الوقت نفسه في البلدان ذات الدخل المرتفع ، تكون الفئة العمرية الأكثر شيوعًا أكبر بقليل (25-44). ما هي السياسات المتعلقة بالتبرع بالدم حول العالم؟ يوجد لدى أكثر من 168 دولة نظام قائم لجمع التبرعات بالدم. 81 في المائة من التبرعات بالدم من البلدان المرتفعة الدخل لديها سياسة وطنية (هذا هو المكان الذي يأتي منه أكثر من 50 في المائة من التبرعات) ، في حين أن 44 في المائة من البلدان منخفضة الدخل لديها سياسة محددة. توصي منظمة الصحة العالمية بتنفيذ نظام اختبار وفحص لجميع التبرعات بالدم ، وهي سياسة تلتزم بها العديد من البلدان ذات الدخل المرتفع. مع اختبار فيروس نقص المناعة البشرية ، قد يكون هذا معقدًا ، لأن الفيروس يمكن أن يظل غير مكتشف لمدة 22 يومًا في المتوسط. أين يمكنك أن تدفع مقابل التبرع بالدم؟يمكنك الحصول على أموال مقابل التبرع بالدم في 25 دولة حول العالم. ستمنحك بعض الدول إجازة مدفوعة الأجر من العمل للتبرع بالدم ، بينما تدفع دول أخرى مثل ألمانيا والصين والولايات المتحدة وروسيا تبرعات البلازما. ما هو استخدام الدم المتبرع به؟ يستخدم الدم لجميع أنواع الأغراض. السرطان (عمليات نقل الدم أثناء العلاج الكيميائي) والجراحة والصدمات وثلاثة أسباب شائعة للتبرع بالدم. تستخدم التبرعات بالدم الكامل في غالبية العلاجات الطبية ، وبعضها لا يتطلب سوى جمع البلازما أو الصفائح الدموية واستخدامها. بشكل عام ، يتطلب 22 علاجًا طبيًا التبرع بالدم. عندما تتبرع بالدم ، عادة ما تقوم منظمات مثل الصليب الأحمر بفصل الدم الكامل إلى خلايا الدم الحمراء والبلازما والصفائح الدموية في المختبر. يمكن للبلازما أن تعالج جميع أنواع الأمراض مثل السرطان وأمراض الدم والناعور وفقر الدم وأمراض القلب وأمراض المعدة وأمراض الكلى والولادة والعمليات وفقدان الدم والصدمات والحروق.

source: Available to donate
ar: متاح للتبرع

# appointment
source: Appointments
ar: حجز موعد للتبرع بالدم

# Donation Requests
source: Urgent blood requests
ar: طلبات دم عاجله

source: Donation History
ar: التبرعات السابقه

# Your Story
source: Stories
ar: قصص

source: Volunteers
ar: المتطوعين

source: Corona Stats
ar: احصائيات كورونا

source: Favorite
ar: المفضلات

source: Buy Blood
ar: شراء الدم

source: Privacy policy
ar: سياسه الخصوصيه

source: Setting
ar: الاعدادات

source: Log out
ar: تسجيل الخروج

source: COVID-19 Live Update
ar: متتبع فيروس كورونا المباشر

source: Stay Safe
ar: حافظ علي صحتك وابق آمناً

source: global Update
ar: احصائيات كورونا علي مستوي العالم

source: Cases
ar: الحالات

source: Recovered
ar: المتعافين

source: Deaths
ar: الضحايا

source: population
ar: التعداد السكاني

source: Critical
ar: الحالات الحرجه

source: Active
ar: الحالات النشطه

source: K
ar: الف

source: M
ar: مليون

source: B
ar: بليون

# First Title
source: Blood Request
ar: طلب دم

# Second Title
source: Create new blood orders matching your needs within seconds.
ar: قم بإنشاء طلبات دم جديدة تتوافق مع احتياجاتك في غضون ثوان.

source: Request Type:
ar: نوع الطلب:

source: Reason of the Request:
ar: سبب الطلب:

# City Title
source: What is Your Governorate?
ar: ما هي محافظتك؟

# Town Title
source: What is Your City?
ar: ما هي مدينتك؟

# Hospital Title
source: In which hospital do you need a blood donor?
ar: في أي مستشفى تحتاج إلى متبرع بالدم؟

# Notes Title
source: Write a message to the Donors.
ar: اكتب رسالة إلى المتبرعين.

source: Next
ar: استمرار

source: Back
ar: رجوع

source: Finish
ar: انهاء

source: Donate Blood
ar: حجز موعد للتبرع بالدم

source: Donate Money
ar: التبرع بالاموال

source: Vaccine request
ar: طلب لقاح

# vaccineRequestSubTitle
source: Buy vaccines that match your needs within minutes
ar: قم بشراء لقاحات تتوافق مع احتياجاتك في غضون دقائق

# donate Blood
source: Donate Blood or Money
ar: التبرع بالدم او الاموال

# donateBloodSubTitle
source: Donating blood & money can make you a hero to someone in need
ar: التبرع بالدم او الاموال يمكن أن يجعلك بطلاً لشخص محتاج

source: Order Blood
ar: طلب دم

# orderBloodSubTitle
source: We are here to help you submit a request for blood
ar: نحن هنا لمساعدتك في تقديم طلب التبرع بالدم

# educate
source: Educate yourSelf
ar: تعلم بنفسك

# educateSubTitle
source: Learn more about blood, its types, and how to donate blood
ar: تعرف على المزيد حول الدم وأنواعه وكيفية التبرع بالدم

source: Welcome
ar: اهلا وسهلا

# NameDonor
source: Here,The Name of the Donor
ar: هنا اسم المتبرع بالدم

# MainSubTitle
source: Be a hero in someone's life o_o ❤️‍🩹
ar: كن بطلا في حياه شخص ما o_O ❤️‍🩹

source: Fist Name:
ar: الاسم الاول

source: Family Name:
ar: اسم العائله

source: Email:
ar: البريد الاكتروني

# Governrate
source: Governorate:
ar: المحافظه

source: City:
ar: المدينه

# FistNum
source: Fist Number:
ar: رقم الموبايل الاول

# SecondNum
source: Second Number:
ar: رقم الموبايل الثاني

source: Password:
ar: الرقم السري

source: Blood Type:
ar: فصيله الدم

source: Gender:
ar: الجنس

source: ID:
ar: الرقم القومي

# BirthDate
source: Date of Birth:
ar: تاريخ الميلاد

source: History
ar: السجلات

source: Location
ar: الموقع
